In [37]:
import pandas as pd
df = pd.read_csv("ecommerce.csv")
df.head(5)
df.tail(5)
df.describe()

             Price  Discount (%)  Final_Price(Rs.)
count  3656.000000   3660.000000       3660.000000
mean    254.871701     18.825137        206.906579
std     141.703494     14.731338        122.687844
min      10.090000      0.000000          5.890000
25%     134.012500      5.000000        104.512500
50%     254.020000     15.000000        199.185000
75%     377.735000     25.000000        304.117500
max     499.960000     50.000000        496.820000

In [38]:
df.dtypes

User_ID              object
Product_ID           object
Category             object
Price               float64
Discount (%)          int64
Final_Price(Rs.)    float64
Payment_Method       object
Purchase_Date        object
dtype: object

In [39]:
## Handling missing values
df.isnull()
## df.isnull().sum()

,User_ID,Product_ID,Category,Price,Discount (%),Final_Price(Rs.),Payment_Method,Purchase_Date
0,False,False,False,True,False,False,False,False
1,False,False,False,True,False,False,False,False
2,False,False,False,True,False,False,False,False
3,False,False,True,True,False,False,False,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
3655,False,False,False,False,False,False,False,False
3656,False,False,False,False,False,False,False,False
3657,False,False,False,False,False,False,False,False
3658,False,False,False,False,False,False,False,False
3659,False,False,False,False,False,False,False,False

In [35]:
""" Fill the missisng values by 0 """
newData = df.fillna(0)
newData.isnull().sum()

User_ID             0
Product_ID          0
Category            0
Price               0
Discount (%)        0
Final_Price(Rs.)    0
Payment_Method      0
Purchase_Date       0
dtype: int64

In [42]:
## Fill the missing values by the mean of the column
newData['Price_fillNa'] = df['Price'].fillna(df['Price'].mean())
newData

,User_ID,Product_ID,Category,Price,Discount (%),Final_Price(Rs.),Payment_Method,Purchase_Date,Price_fillNa
0,337c166f,f414122f-e,Sports,0.00,15,31.05,Net Banking,12-11-2024,254.871701
1,d38a19bf,fde50f9c-5,Clothing,0.00,20,186.23,Net Banking,09-02-2024,254.871701
2,d7f5f0b0,0d96fc90-3,Sports,0.00,25,237.76,Credit Card,01-09-2024,254.871701
3,395d4994,964fc44b-d,0,0.00,25,129.89,UPI,01-04-2024,254.871701
4,a83c145c,d70e2fc6-e,Beauty,244.80,20,195.84,Net Banking,27-09-2024,244.800000
...,...,...,...,...,...,...,...,...,...
3655,67abda0a,28714133-6,Beauty,486.79,0,486.79,UPI,14-05-2024,486.790000
3656,34ebc1a0,08838c2c-9,Toys,212.87,15,180.94,Cash on Delivery,19-11-2024,212.870000
3657,1defd3b1,c39a4f16-6,Home & Kitchen,389.76,0,389.76,Net Banking,07-08-2024,389.760000
3658,0611293d,b4f67f96-9,Electronics,447.66,30,313.36,UPI,21-05-2024,447.660000
3659,e73ad07c,a5d07442-d,Home & Kitchen,235.77,30,165.04,UPI,14-04-2024,235.770000

In [43]:
df.dtypes

User_ID              object
Product_ID           object
Category             object
Price               float64
Discount (%)          int64
Final_Price(Rs.)    float64
Payment_Method       object
Purchase_Date        object
dtype: object

In [45]:
## Rename columns
newData = newData.rename(columns={'Price_fillNa':'Price without NA'})
newData

,User_ID,Product_ID,Category,Price,Discount (%),Final_Price(Rs.),Payment_Method,Purchase_Date,Price without NA
0,337c166f,f414122f-e,Sports,0.00,15,31.05,Net Banking,12-11-2024,254.871701
1,d38a19bf,fde50f9c-5,Clothing,0.00,20,186.23,Net Banking,09-02-2024,254.871701
2,d7f5f0b0,0d96fc90-3,Sports,0.00,25,237.76,Credit Card,01-09-2024,254.871701
3,395d4994,964fc44b-d,0,0.00,25,129.89,UPI,01-04-2024,254.871701
4,a83c145c,d70e2fc6-e,Beauty,244.80,20,195.84,Net Banking,27-09-2024,244.800000
...,...,...,...,...,...,...,...,...,...
3655,67abda0a,28714133-6,Beauty,486.79,0,486.79,UPI,14-05-2024,486.790000
3656,34ebc1a0,08838c2c-9,Toys,212.87,15,180.94,Cash on Delivery,19-11-2024,212.870000
3657,1defd3b1,c39a4f16-6,Home & Kitchen,389.76,0,389.76,Net Banking,07-08-2024,389.760000
3658,0611293d,b4f67f96-9,Electronics,447.66,30,313.36,UPI,21-05-2024,447.660000
3659,e73ad07c,a5d07442-d,Home & Kitchen,235.77,30,165.04,UPI,14-04-2024,235.770000

In [46]:
## change the data types of columns
newData['Price'] = newData['Price'].astype('int')
newData.dtypes

User_ID              object
Product_ID           object
Category             object
Price                 int64
Discount (%)          int64
Final_Price(Rs.)    float64
Payment_Method       object
Purchase_Date        object
Price without NA    float64
dtype: object

In [50]:
newData['Increased_price'] = newData['Price'].apply(lambda x: x*10)
newData

,User_ID,Product_ID,Category,Price,Discount (%),Final_Price(Rs.),Payment_Method,Purchase_Date,Price without NA,Increased_price
0,337c166f,f414122f-e,Sports,0,15,31.05,Net Banking,12-11-2024,254.871701,0
1,d38a19bf,fde50f9c-5,Clothing,0,20,186.23,Net Banking,09-02-2024,254.871701,0
2,d7f5f0b0,0d96fc90-3,Sports,0,25,237.76,Credit Card,01-09-2024,254.871701,0
3,395d4994,964fc44b-d,0,0,25,129.89,UPI,01-04-2024,254.871701,0
4,a83c145c,d70e2fc6-e,Beauty,244,20,195.84,Net Banking,27-09-2024,244.800000,2440
...,...,...,...,...,...,...,...,...,...,...
3655,67abda0a,28714133-6,Beauty,486,0,486.79,UPI,14-05-2024,486.790000,4860
3656,34ebc1a0,08838c2c-9,Toys,212,15,180.94,Cash on Delivery,19-11-2024,212.870000,2120
3657,1defd3b1,c39a4f16-6,Home & Kitchen,389,0,389.76,Net Banking,07-08-2024,389.760000,3890
3658,0611293d,b4f67f96-9,Electronics,447,30,313.36,UPI,21-05-2024,447.660000,4470
3659,e73ad07c,a5d07442-d,Home & Kitchen,235,30,165.04,UPI,14-04-2024,235.770000,2350

In [71]:
## aggregate data
groupedData = newData.groupby('Payment_Method')['Price'].agg(['mean', 'sum','count'])
groupedData
groupedData = groupedData.iloc[1:]
groupedData

                        mean     sum  count
Payment_Method
Cash on Delivery  256.530172  178545    696
Credit Card       250.938076  190462    759
Debit Card        257.648427  188341    731
Net Banking       254.286713  181815    715
UPI               251.739762  190567    757

In [73]:
##merge data and join data
data1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3'],
                     'key': ['K0', 'K1', 'K2', 'K3']})
data2 = pd.DataFrame({'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3'],
                      'key': ['K0', 'K1', 'K2', 'K3']})
pd.merge(data1, data2, on='key',how='inner')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3